Revit 2026 API

# IFCParameterTemplateSetPropertySetApplicableEntities Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	string propertySetName,
	IList<string> applicableEntities
)
```
```vb
Public Sub SetPropertySetApplicableEntities (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	applicableEntities As IList(Of String)
)
```
```cpp
public:
void SetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	IList<String^>^ applicableEntities
)
```
```fsharp
member SetPropertySetApplicableEntities :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        applicableEntities : IList<string> -> unit
```

#### Parameters

propertySetupType PropertySetupType

propertySetName String

applicableEntities IListString

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace